[
  [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "Standard",
    "Description",
    "Date of adoption",
    "Effect on financial statements"
  ],
  [
    "",
    "",
    "",
    ""
  ],
  [
    "ASU 2022-02 Financial Instruments-Credit Losses (Topic 326): Troubled Debt Restructurings and Vintage Disclosures",
    "The FASB issued these amendments to eliminate accounting guidance for TDRs by creditors in Subtopic 310-40, Receivables-Troubled Debt Restructurings by Creditors, while enhancing disclosure requirements for certain loan refinancings and restructurings by creditors when a borrower is experiencing financial difficulty, and to require that an entity disclose current-period gross writeoffs by year of origination for financing receivables and net investments in leases within the scope of Subtopic 326-20, Financial Instruments-Credit Losses-Measured at Amortized Cost. The amendments in this Update are effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, and should be applied prospectively, except as provided in the next sentence. For the transition method related to the recognition and measurement of TDRs, an entity has the option to apply a modified retrospective transition method, resulting in a cumulative-effect adjustment to retained earnings in the period of adoption. Early adoption is permitted if an entity has adopted the amendments in Update 2016-03, including adoption in an interim period.",
    "1st Quarter 2023",
    "Adoption of this amendment did not have a material impact on the Corporation's results of operation, financial position or liquidity, but resulted in additional disclosure requirements related to gross charge offs by vintage year and the removal of TDR disclosures, replaced by additional disclosures on the types of modifications of loans to borrowers experiencing financial difficulties. The Corporation has adopted this update prospectively."
  ]
]