[
  [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "Standard",
    "Description",
    "Date of adoption",
    "Effect on financial statements"
  ],
  [
    "ASU 2023-02 Investments-Equity Method and Joint Ventures (Topic 323): Accounting for Investments in Tax Credit Structures Using the Proportional Amortization Method",
    "The amendments in this update permit reporting entities to elect to account for their tax equity investments, regardless of the tax credit program from which the income tax credits are received, using the proportional amortization method if certain conditions are met. A reporting entity may make an accounting policy election to apply the proportional amortization method on a tax-credit-program-by-tax-credit-program basis rather than electing to apply the proportional amortization method at the reporting entity level or to individual investments. The amendments in this update also remove certain guidance for Qualified Affordable Housing Project investments and require the application of the delayed equity contribution guidance to all tax equity investments. The amendments in this update are effective for fiscal years beginning after December 15, 2023, and must be applied on either a modified retrospective or a retrospective basis. Early adoption is permitted in any interim period, however if adopted in an interim period the entity shall adopt the amendments in this update as of the beginning of the fiscal year that includes the interim period.",
    "1st Quarter 2024",
    "Adoption of this amendment is not expected to have a material impact on the Corporation's current results of operation, financial position, liquidity or disclosures."
  ],
  [
    "ASU 2023-07 Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures",
    "The amendments in this update improve financial reporting by requiring disclosure of incremental segment information on an annual and interim basis for all public entities to enable investors to develop more decision-useful financial analyses. The amendments in this update also do not change how a public entity identifies its operating segments, aggregates those operating segments, or applies the quantitative thresholds to determine its reportable segments. The amendments in this update are effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024. Early adoption is permitted.",
    "Fiscal year 2024 and interim periods beginning in 1st quarter 2025",
    "The Corporation is currently evaluating the impact on its results of operation, financial position, liquidity, and disclosures."
  ],
  [
    "ASU 2023-09 Income Taxes (Topic 740): Improvements to Income Tax Disclosures",
    "The amendments in this update address investor requests for more transparency about income tax information through improvements to income tax disclosures primarily related to the rate reconciliation and income taxes paid information. This update also includes certain other amendments to improve the effectiveness of income tax disclosures. The amendments in this update are effective for fiscal years beginning after December 15, 2024 and are to be applied on a prospective basis. Early adoption is permitted.",
    "1st Quarter 2025",
    "The Corporation is currently evaluating the impact on its disclosures."
  ]
]