[
  [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "Revenue Stream",
    "",
    "Noninterest Income In-Scope of Topic 606"
  ],
  [
    "",
    "",
    ""
  ],
  [
    "Service charges and deposit account fees",
    "",
    "Service charges and deposit account fees consist of monthly service fees (i.e. business analyzed fees and consumer service charges) and other deposit account related fees. The Corporation's performance obligation for monthly service fees is generally satisfied, and the related revenue recognized, over the period in which the service is provided. Other deposit account related fees are largely transactional based, and therefore, the Corporation's performance obligation is satisfied, and related revenue recognized, at a point in time. Payment for service charges and deposit account fees is primarily received immediately or in the following month through a direct charge to customers’ accounts."
  ],
  [
    "Card-based fees(a)",
    "",
    "Card-based fees are primarily comprised of debit and credit card income, ATM fees, and merchant services income. Debit and credit card income is primarily comprised of interchange fees earned whenever the Corporation's debit and credit cards are processed through card payment networks. ATM and merchant fees are largely transactional based, and therefore, the Corporation's performance obligation is satisfied, and related revenue recognized, at a point in time. Payment is typically received immediately or in the following month."
  ],
  [
    "Trust and asset management fees(b)",
    "",
    "Trust and asset management income is primarily comprised of fees earned from the management and administration of trusts and other customer assets. The Corporation's performance obligation is generally satisfied over time and the resulting fees are recognized monthly, based upon the month-end market value of the assets under management and the applicable fee rate. Payment is generally received a few days after month end through a direct charge to the customers’ accounts. The Corporation's performance obligation for these transactional-based services is generally satisfied, and related revenue recognized, at a point in time (i.e., as incurred). Payment is received shortly after services are rendered."
  ],
  [
    "Brokerage and advisory fees(b)",
    "",
    "Brokerage and advisory fees primarily consist of investment advisory, brokerage, retirement services, and annuities. The Corporation's performance obligation for investment advisory services and retirement services is generally satisfied, and the related revenue recognized, over the period in which the services are provided. The performance obligation for annuities is satisfied upon sale of the annuity, and therefore, the related revenue is primarily recognized at the time of sale. Payment for these services is typically received immediately or in advance of the service."
  ]
]