[
  [
    "",
    "",
    ""
  ],
  [
    "Form of Distribution:",
    "",
    "The distribution of the Notes is being made to purchasers in each of the provinces of Canada (the “Offering Jurisdictions”) under a Canadian offering memorandum dated August [●], 2017 (the “Canadian Offering Memorandum”), which will include the U.S. prospectus dated April 28, 2016, as supplemented by a U.S. prospectus supplement dated August [●], 2017 that form part of the registration statement filed with the United States Securities and Exchange Commission. The distribution will be made in reliance on statutory exemptions from the prospectus requirements of Canadian securities laws applicable in each of the Offering Jurisdictions and, in particular, the Notes will only be sold in:a) the province of Alberta, pursuant to the “accredited investor exemption” (as defined in National Instrument45-106—Prospectus Exemptions(“NI45-106”))and therefore only to purchasers that are “accredited investors” (as such term is defined in NI45-106)who purchase the Notes as principal (or are deemed to be purchasing as principal) that are not individuals unless those individuals are also “permitted clients” (as such term is defined in National Instrument31-103—Registration Requirements, Exemptions and Ongoing Registrant Obligations) and was not created or used solely to purchase or hold securities as an accredited investor as described in paragraph (m) of the definition of “accredited investor” in NI45-106;andb) the Offering Jurisdictions other than the province of Alberta, pursuant to the C$150,000 minimum amount investment exemption, and therefore only to purchasers that are not individuals and that are purchasing as principal, Notes with an acquisition cost to each purchaser of not less than C$150,000 paid in cash at the time of closing, unless such a purchaser is a person acting on behalf of a fully managed account described in paragraph (p) or (q) of the definition of “accredited investor” in section 1.1 of NI45-106in which case the Notes may only be sold on a private placement basis to such purchaser pursuant to the “accredited investor exemption”."
  ]
]