[
  [
    "",
    "•",
    "",
    "“Comparison Group” means the Company and each other company included in the Standard & Poor’s 500 index on the first day of the Performance Period and, except as provided below, the common stock (or similar equity security) of which continues to be listed or traded on a national securities exchange through the last trading day of the Performance Period. In the event a member of the Comparison Group files for bankruptcy or liquidates due to an insolvency, such company shall continue to be treated as a Comparison Group member, and such company’s Ending Price will be treated as $0 if the common stock (or similar equity security) of such company is no longer listed or traded on a national securities exchange on the last trading day of the Performance Period. In the event of a formation of a new parent company by a Comparison Group member, substantially all of the assets and liabilities of which consist immediately after the transaction of the equity interests in the original Comparison Group member or the assets and liabilities of such Comparison Group member immediately prior to the transaction, such new parent company shall be substituted for the Comparison Group member to the extent (and for such period of time) as its common stock (or similar equity securities) are listed or traded on a national securities exchange but the common stock (or similar equity securities) of the original Comparison Group member are not. In the event of a merger or other business combination of two Comparison Group members (including, without limitation, the acquisition of one Comparison Group member, or all or substantially all of its assets, by another Comparison Group member), the surviving, resulting or successor entity, as the case may be, shall continue to be treated as a member of the Comparison Group, provided that the common stock (or similar equity security) of such entity is listed or traded on a national securities exchange through the last trading day of the Performance Period. With respect to the preceding two sentences, the applicable stock prices shall be equitably and proportionately adjusted to the extent (if any) necessary to preserve the intended incentives of the awards and mitigate the impact of the transaction."
  ]
]