[
  [
    "1.",
    "Under the ROC laws, no offer and sale of securities by foreign issuers in the ROC can be made unless it is exempted or is made with prior approval or post registration with the relevant governmental authorities pursuant to the relevant ROC laws and regulations. Pursuant to a ruling issued by the Financial Supervisory Commission (the “FSC”) dated December 28, 2016 (Ref. No.:Jin-Guan-Zheng-Fa-1050042349),the straight bonds denominated in foreign currency issued by foreign issuers in the ROC which will be offered, sold and issued to professional investors as defined under the Taipei Exchange Securities Market Rules Governing Management of Foreign Currency Denominated International Bonds (the “TPEx Rules”) are exempted from the requirement to obtain prior approval from the FSC. On such basis, no consents, approvals or authorizations of, or registration or filing with, any governmental authority or agency in the ROC are required by the laws of the ROC for the offer, sale and issue of the Securities by the Issuer in the ROC or the performance by the Issuer of its obligations under the Transaction Documents and the Securities, except for: (A) the reporting to the CBC (with a copy to the TPEx) and the listing application to and approval from the TPEx as required pursuant to the relevant ROC laws and regulations, which have been satisfied by the CBC Reporting Letter and the TPEx Listing Approval, respectively; (B) the reporting to the TSA for the Subscription Agreement and approval of the TSA for recordation of the Subscription Agreement , which has been satisfied by the TSA Approval Letter; and (C) the filings and approvals required under the TPEx Rules, Taipei Exchange Rules Governing Securities Trading on the TPEx, the Operating Rules of the Taiwan Depository & Clearing Corporation, the Taiwan Depository & Clearing Corporation Guidelines for Book-Entry Operations of Foreign Currency Denominated International Bonds and the Securities and Exchange Act of the ROC and as required by the CBC, the FSC, the TPEx and the TDCC from time to time;providedthatthe failure to comply withsub-clause(C) will not affect the validity of the Securities."
  ]
]